hr12b/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    side01
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          4350;
        startFace       664942;
    }
    side02
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          4350;
        startFace       669292;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1508;
        startFace       673642;
    }
    top
    {
        type            patch;
        nFaces          1508;
        startFace       675150;
    }
    inlet
    {
        type            patch;
        nFaces          7800;
        startFace       676658;
    }
    outlet
    {
        type            patch;
        nFaces          7800;
        startFace       684458;
    }
)

// ************************************************************************* //
